[
    {
      "id": "1",
      "title": "The Thirty-Nine Steps",
      "author": "John Buchan",
      "year": 1915,
      "genre": "History",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/12621950-M.jpg",
      "tagline": "The Thirty-Nine Steps is an adventure novel by Scottish author John Buchan. It was first serialized in All-Story Weekly and Blackwood's Magazine in 1915 before being published in book form in October 1915 by William Blackwood and Sons, Edinburgh. The novel is an espionage thriller and the first of five of Buchan’s novels to feature the character Richard Hannay. The novel takes readers on a breathtaking series of exciting exploits featuring German villains that take place in May and June of 1914.",
      "previewLink": "https://standardebooks.org/ebooks/john-buchan/the-thirty-nine-steps/text/single-page"
    },
    {
      "id": "2",
      "title": "Pollyanna Grows Up",
      "author": "Eleanor H. Porter",
      "year": 1996,
      "genre": "Fiction",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/6807750-L.jpg",
      "tagline": "Her crippled legs cured, Pollyanna takes her glad heart to cheer new friends in Boston before travelling to Europe with Aunt Polly and Dr. Chilton. But growing up brings sorrows as well as joys, and when she returns after six years, with Dr. Chilton dead and Aunt Polly fallen on hard times, even Pollyanna has trouble maintaining her usual cheerful outlook",
      "previewLink": "https://standardebooks.org/ebooks/eleanor-h-porter/pollyanna-grows-up/text/single-page"
    },
    {
      "id": "3",
      "title": "Lilith",
      "author": "George MacDonald",
      "year": 1895,
      "genre": "Fantasy",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/12621653-L.jpg",
      "tagline": "Lilith, first published in 1895, tells the story of Mr. Vane, the owner of a library that seems to be haunted by a raven—the ghost of the library’s former owner. Mr. Vane eventually follows this strange figure through a mirror and into another world, the “region of seven dimensions.” There Vane meets a number of characters, including Biblical characters like Adam and his first wife Lilith. Thus begins a battle of good versus evil that reverberates through dimensions. The narrative is heavy with Christian allegory, and MacDonald uses the world to expound on his Christian universalist philosophy while telling a story of life, death and ultimately salvation. Critics consider Lilith to be one of MacDonald’s darker works, but opinion on it is divided. Despite this, some critics praise it for its rich imagery, with scholar Neil Barron claiming that the novel is the “obvious parent of David Lindsay’s A Voyage to Arcturus,” itself a highly influential work of fantasy.",
      "previewLink": "https://standardebooks.org/ebooks/george-macdonald/lilith/text/single-page"
    },
     {
      "id": "4",
      "title": "First Lensman",
      "author": "Edward Elmer Smith",
      "year": 1950,
      "genre": "Science Fiction",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/12621713-L.jpg",
      "tagline": "Against the backdrop of a secret war between two all-powerful alien races, Virgil Samms of the Triplanetary Service is selected by the seemingly omniscient Arisians to be the first bearer of the Lens. Only individuals deemed brave, virtuous, capable, and incorruptible can receive a Lens, which grants its user telepathy and other powers. With it, Samms seeks out other “Lens worthy” humans and aliens, with the goal of creating a Galactic Patrol that will defend planets adhering to Civilization from corruption, vice, and piracy. First Lensman is the second book in E. E. Smith’s Lensman series but was the last to be written. Unlike the rest of the series, it was never serialized, and was first published in 1950 to help link Triplanetary with Galactic Patrol. Smith’s imaginative and bizarre alien races are on full display, as well as the constantly escalating space warfare that is the hallmark of the space opera genre",
      "previewLink": "https://standardebooks.org/ebooks/e-e-smith/first-lensman/text/single-page"
    },
     {
      "id": "5",
      "title": "In a Glass Darkly",
      "author": "Joseph Sheridan Le Fanu",
      "year": 1869,
      "genre": "Horror",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/12621978-L.jpg",
      "tagline": "In a Glass Darkly is a collection of five short stories, presented as posthumous papers of cases of the “metaphysical” doctor Dr. Martin Hesselius. First appearing in “Green Tea,” originally published in 1869, Dr. Hesselius became one of the first literary occult detectives.",
      "previewLink": "https://standardebooks.org/ebooks/j-sheridan-le-fanu/in-a-glass-darkly/text/single-page"
    },
     {
      "id": "6",
      "title": "The Art of War",
      "author": "Sun Tzu",
      "year": 1900,
      "genre": "Fiction",
      "coverImageUrl": "https://covers.openlibrary.org/b/id/14635760-L.jpg",
      "tagline": "Sun Tzu’s ancient treatise on the art of war has exerted enormous influence over both Asian and Western soldiers, covering subjects ranging from morale and discipline to the correct use of spies. Despite questions about the historicity of the author, the text has stood the test of time and remains widely read by strategists, politicians, and even business leaders today. Though Dr. Lionel Giles was not the first to translate Sun Tzu into English, he was the first to do so in a systematic and scholarly manner. His translation was unequaled until the mid-20th century, and remains relevant today due to his copious notes.",
      "previewLink": "https://standardebooks.org/ebooks/sun-tzu/the-art-of-war/lionel-giles/text/single-page"
    },
     {
    "id": "7",
    "title": "Alice's Adventures in Wonderland",
    "author": "Lewis Carroll",
    "year": 1954,
    "genre": "Fantasy",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/14547392-L.jpg",
    "tagline": "A very real little girl named Alice follows a remarkable rabbit down a rabbit hole and steps through a looking-glass to come face to face with some of the strangest adventures and some of the oddest characters in all literature. The crusty Duchess, the Mad Hatter, the weeping Mock Turtle, the diabolical Queen of Hearts, the Cheshire-Cat, Tweedledum and Tweedledee--each one is more eccentric, and more entertaining, than the last. And all of them could only have come from the pen of Lewis Carroll, one of the few adults ever to enter successfully the children's world of make-believe--a wonderland where the impossible becomes possible, the unreal, real...where the heights of adventure are limited only by the depths of imagination.",
    "previewLink": "https://standardebooks.org/ebooks/lewis-carroll/alices-adventures-in-wonderland/john-tenniel/text/single-page"
    },
    {
    "id": "8",
    "title": "20 years at Hull-House",
    "author": "Jane Addams",
    "year": 2012,
    "genre": "History",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/10726345-L.jpg",
    "tagline": "London, 1883. Jane Addams came upon a crowd of poor, hungry people all struggling to outbid each other for a measly supply of rotten vegetables. Haunted by the memory of their clutching, desperate hands, she continued her travels through Europe, eventually settling in Chicago. There, with her friend Ellen Starr, she founded Hull-House. In this book, first published in 2010, Addams details the history of an inspiring institution that dedicated itself to providing a resource for cultural improvement to immigrant and poor communities throughout Chicago, and still inspires today.",
    "previewLink": "https://standardebooks.org/ebooks/jane-addams/twenty-years-at-hull-house/text/single-page"
    },
    {
    "id": "9",
    "title": "Dracula",
    "author": "Bram Stoker",
    "year": 2016,
    "genre": "Horror",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/12122533-L.jpg",
    "tagline": "Dracula first horrified readers over 125 years ago. Today, this original gothic masterpiece includes a detailed exploration into the 1897 classic vampire novel and its author, Bram Stoker.",
    "previewLink": "https://standardebooks.org/ebooks/bram-stoker/dracula/text/single-page"
    },
    {
    "id": "10",
    "title": "Uller Uprising",
    "author": "H. Beam Piper",
    "year": 1983,
    "genre": "Science Fiction",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/14587081-L.jpg",
    "tagline": "Terra has a problem. The Ullr are uprising and the uprising must be put down at any cost. A brilliant retelling of the Sepoy Mutiny set against an interstellar empire. H. Beam Piper was one of the best writers of space opera that science fiction ever produced.",
    "previewLink": "http://standardebooks.org/ebooks/h-beam-piper/uller-uprising/text/single-page"
    },
    {
    "id": "11",
    "title": "Sylvie and Bruno",
    "author": "Lewis Carroll",
    "year": 1988,
    "genre": "Fantasy",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/14546094-L.jpg",
    "tagline": "Two little children meet adventure in such places as Dogland, Outland, and Elfland.",
    "previewLink": "http://standardebooks.org/ebooks/lewis-carroll/sylvie-and-bruno/text/single-page"
    },
    {
    "id": "13",
    "title": "Frankenstein",
    "author": "Marry Shelly",
    "year": 2022,
    "genre": "Horror",
    "coverImageUrl": "https://covers.openlibrary.org/b/id/12752093-L.jpg",
    "tagline": "Frankenstein; or, The Modern Prometheus (1818) is a novel written by English author Mary Shelley. The novel follows Victor Frankenstein, a young scientist who, using unorthodox scientific experiments, creates a sapient creature. At just 18 years old Shelley began writing the novel which was later published anonymously in London in 1818, when she was 20. Her name first appeared in the second edition, which was published in Paris in 1821.",
    "previewLink": "https://standardebooks.org/ebooks/mary-shelley/frankenstein/text/single-page"
    }

  ]
